<!doctype html>
<!--
  Minimal Mistakes Jekyll Theme 4.19.3 by Michael Rose
  Copyright 2013-2019 Michael Rose - mademistakes.com | @mmistakes
  Free for personal and commercial use under the MIT license
  https://github.com/mmistakes/minimal-mistakes/blob/master/LICENSE
-->
<html lang="es" class="no-js">
  <head>
    <meta charset="utf-8">

<!-- begin _includes/seo.html --><title></title>
<meta name="description" content="">


  <meta name="author" content="Héctor Patricio">


<meta property="og:type" content="website">
<meta property="og:locale" content="es">
<meta property="og:site_name" content="">
<meta property="og:title" content="">
<meta property="og:url" content="http://localhost:4000/feed.json">













<link rel="canonical" href="http://localhost:4000/feed.json">




<script type="application/ld+json">
  {
    "@context": "https://schema.org",
    
      "@type": "Person",
      "name": null,
      "url": "http://localhost:4000/"
    
  }
</script>






<!-- end _includes/seo.html -->


<link href="/feed.xml" type="application/atom+xml" rel="alternate" title=" Feed">

<!-- https://t.co/dKP3o1e -->
<meta name="viewport" content="width=device-width, initial-scale=1.0">

<script>
  document.documentElement.className = document.documentElement.className.replace(/\bno-js\b/g, '') + ' js ';
</script>

<!-- For all browsers -->
<link rel="stylesheet" href="/assets/css/main.css">

<!--[if IE]>
  <style>
    /* old IE unsupported flexbox fixes */
    .greedy-nav .site-title {
      padding-right: 3em;
    }
    .greedy-nav button {
      position: absolute;
      top: 0;
      right: 0;
      height: 100%;
    }
  </style>
<![endif]-->



    
<!-- favicon -->
<link rel="apple-touch-icon" sizes="180x180" href="/assets/images/favicons/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/assets/images/favicons/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/assets/images/favicons/favicon-16x16.png">
<link rel="manifest" href="/assets/images/favicons/site.webmanifest">
<link rel="mask-icon" href="/assets/images/favicons/safari-pinned-tab.svg" color="#5bbad5">
<link rel="shortcut icon" href="/assets/images/favicons/favicon.ico">
<meta name="msapplication-TileColor" content="#da532c">
<meta name="msapplication-config" content="/assets/images/favicons/browserconfig.xml">
<meta name="theme-color" content="#ffffff">
<!-- end favicon -->


<!-- Hotjar Tracking Code for blog.thedojo.mx -->
<script>
    (function(h,o,t,j,a,r){
        h.hj=h.hj||function(){(h.hj.q=h.hj.q||[]).push(arguments)};
        h._hjSettings={hjid:1217463,hjsv:6};
        a=o.getElementsByTagName('head')[0];
        r=o.createElement('script');r.async=1;
        r.src=t+h._hjSettings.hjid+j+h._hjSettings.hjsv;
        a.appendChild(r);
    })(window,document,'https://static.hotjar.com/c/hotjar-','.js?sv=');
</script>

<script src="/assets/js/sharect.min.js"></script>

<script type="application/ld+json">
    {
      "@context": "https://schema.org",
      "@type": "BlogPosting",
      "url": "http://localhost:4000/feed.json",
      "name": null,
      "headline": null,
      "keywords": "",
      "description": "",
      "articleBody": "{\n  \"version\": \"https://jsonfeed.org/version/1\",\n  \"title\": {{ site.title | jsonify }},\n  \"description\": {% if site.description %}{{ site.description | jsonify }}{% endif %},\n  \"home_page_url\": \"{{ site.url }}\",\n  \"feed_url\": \"{{ site.url }}/feed.json\",\n  \"favicon\": \"{{ site.url}}/favicon.png\",\n  {% if site.author %}\n  \"author\": {\n    \"name\": {{ site.author | jsonify }}\n  },\n  {% endif %}\n  \"items\": [\n    \n    {% for post in site.posts limit:10 %}\n    {\n      \"id\": \"{{ post.url | prepend: site.baseurl | prepend: site.url }}\",\n      \"url\": \"{{ post.url | prepend: site.baseurl | prepend: site.url }}\",\n      \"title\": {{ post.title | jsonify }},\n      \"content_html\": {{ post.content | jsonify  }},\n      \"date_published\": \"{{ post.date | date_to_rfc822 }}\"\n      }{% unless forloop.last %},{% endunless %}\n    {% endfor %}\n  ]\n}",
      "datePublished": null,
      "dateModified": null,
      "author": {
        "@type": "Person",
        "name": null,
        "givenName": null,
        "email": null
      },
      "publisher": {
        "@type": "Organization",
        "name": null,
        "url": "http://localhost:4000",
        "logo": {
          "@type": "ImageObject",
          "width": 32,
          "height": 32,
          "url": "http://localhost:4000/icon/favicon.ico"
        }
      },
      "mainEntityOfPage": {
        "@type": "WebPage",
        "@id": "http://localhost:4000/feed.json"
      },
      "image": {
        "@type": "ImageObject",
        "width": 1200,
        "height": 400,
        "url": ""
      }
    }
</script>
  </head>

  <body class="layout--single">
    <nav class="skip-links">
  <h2 class="screen-reader-text">Skip links</h2>
  <ul>
    <li><a href="#site-nav" class="screen-reader-shortcut">Skip to primary navigation</a></li>
    <li><a href="#main" class="screen-reader-shortcut">Skip to content</a></li>
    <li><a href="#footer" class="screen-reader-shortcut">Skip to footer</a></li>
  </ul>
</nav>

    <!--[if lt IE 9]>
<div class="notice--danger align-center" style="margin: 0;">You are using an <strong>outdated</strong> browser. Please <a href="https://browsehappy.com/">upgrade your browser</a> to improve your experience.</div>
<![endif]-->

    

<div class="masthead">
  <div class="masthead__inner-wrap">
    <div class="masthead__menu">
      <nav id="site-nav" class="greedy-nav">
        
          <a class="site-logo" href="/"><img src="https://res.cloudinary.com/hectorip/image/upload/v1554098427/TheDojo/the-dojo-transparent.png" alt=""></a>
        
        <a class="site-title" href="/">
          The Dojo Blog
          
        </a>
        <ul class="visible-links"><li class="masthead__menu-item">
              <a href="/latest">Todos los posts</a>
            </li><li class="masthead__menu-item">
              <a href="/about">Acerca de</a>
            </li><li class="masthead__menu-item">
              <a href="https://thedojo.mx">Cursos</a>
            </li></ul>
        
        <button class="search__toggle" type="button">
          <span class="visually-hidden">Toggle search</span>
          <svg class="icon" width="16" height="16" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 15.99 16">
            <path d="M15.5,13.12L13.19,10.8a1.69,1.69,0,0,0-1.28-.55l-0.06-.06A6.5,6.5,0,0,0,5.77,0,6.5,6.5,0,0,0,2.46,11.59a6.47,6.47,0,0,0,7.74.26l0.05,0.05a1.65,1.65,0,0,0,.5,1.24l2.38,2.38A1.68,1.68,0,0,0,15.5,13.12ZM6.4,2A4.41,4.41,0,1,1,2,6.4,4.43,4.43,0,0,1,6.4,2Z" transform="translate(-.01)"></path>
          </svg>
        </button>
        
        <button class="greedy-nav__toggle hidden" type="button">
          <span class="visually-hidden">Toggle menu</span>
          <div class="navicon"></div>
        </button>
        <ul class="hidden-links hidden"></ul>
      </nav>
    </div>
  </div>
</div>


    <div class="initial-content">
      



<div id="main" role="main">
  


  <article class="page" itemscope itemtype="https://schema.org/CreativeWork">
    
    
    
    

    <div class="page__inner-wrap">
      
        <header>
          
          
        </header>
      

      <section class="page__content" itemprop="text">
        
        {
  "version": "https://jsonfeed.org/version/1",
  "title": null,
  "description": ,
  "home_page_url": "http://localhost:4000",
  "feed_url": "http://localhost:4000/feed.json",
  "favicon": "http://localhost:4000/favicon.png",
  
  "author": {
    "name": {"name":"Héctor Patricio","avatar":"/assets/images/me.jpg","bio":"Desarrollador de software, tech lead @ HAL y The Dojo MX","uri":"https://github.com/hectorip","home":null}
  },
  
  "items": [
    
    
    {
      "id": "http://localhost:4000/2020/07/19/traduccion-automatica-de-textos-un-caso-practico.html",
      "url": "http://localhost:4000/2020/07/19/traduccion-automatica-de-textos-un-caso-practico.html",
      "title": "Traducción automática: API's vs tu propio modelo",
      "content_html": "<p>Traducir texto es una tarea frecuente y que puede realizarse de diferentes maneras, en este artículo queremos explorar algunas de ellas.</p>\n\n<p>Existen sitios donde la traducción puede hacerse en línea, como en <a href=\"https://translate.google.com.mx/?hl=es\">Google Translate</a>, sin embargo, en muchos casos existe un límite en la cantidad de texto que puedes traducir.</p>\n\n<p>También puedes utilizar <strong>APIs que pueden ayudarte a hacer dicho trabajo</strong>, dichas APIs también tiene límites por traducción.</p>\n\n<p>Una solución que nos resulta interesante es la traducción utilizando algún modelo de <strong>Aprendizaje de Máquina</strong> que ya haya sido previamente entrenado.  En este artículo podrás explorar estos diferentes métodos y el código que podrías utilizar para llevarlo a cabo, entendiendo las ventajas y desventajas que cada método ofrece.</p>\n\n<p>Hablemos de los diferentes métodos.</p>\n\n<h2 id=\"interfaz-gráfica\">Interfaz gráfica</h2>\n\n<p>Google Translate te permite traducir 5,000 palabras a la vez en su interfaz. Si lo vas a hacer pocas veces y los textos no rebasan esa cantidad de palabras, ¿para qué construir algo?</p>\n\n<p>Esta opción nos recuerda que a veces la mejor solución es que no programemos nada.</p>\n\n<p><strong>Ventajas</strong>: Inmediata, fácil de usar y sin costo.\n<strong>Desventajas</strong>: Requiere intervención humana cada que se tenga que traducir algo.</p>\n\n<h2 id=\"apis\">API’s</h2>\n\n<p>Si quieres automatizar las tareas de traducción para integrarlas en un sistema más grande o generar salidas que se queden almacenadas en archivos o bases de datos, una solución es crear un programa que consuma una API de traducción.</p>\n\n<p>Algunas opciones son:</p>\n\n<ul>\n  <li>\n    <p><strong>Cloud Translation</strong> de Google Cloud Platform. Tiene dos niveles de traducción: el básico que soporta el modelo tradicional de traducción y el avanzado que permite customizar los modelos de traducción además de incluir glosarios y otras monerías.</p>\n  </li>\n  <li><a href=\"https://www.ibm.com/watson/services/language-translator/\">Watson Language Translator</a> permite traducir una gran cantidad de formatos de texto en muchos lenguajes. La únic desventaja es que las API’s</li>\n  <li><strong>Otras</strong>. En <a href=\"https://rapidapi.com/collection/google-translate-api-alternatives\">RapidAPI</a> puedes encontrar una colección actualizada de las alternativas a Google Translation API.</li>\n</ul>\n\n<p>Para desarrollar esta pieza de software, lo más recomendable sería crear un wrapper alrededor de la API y exponer a las demás partes del programa sólo los métodos para poder realizar la tarea de traducción, abstrayendo completamente los detalles de cómo se realiza. De esta manera podrías cambiar de API fácilmente (implementando las llamadas a la nueva API) sin irrumpir en la mayoría del programa.</p>\n\n<p>Además esta forma de hacerlo también sería compatible con el siguiente método:</p>\n\n<ul>\n  <li><strong>AutoML Translation</strong>. Pertenece también a GCP y permite entrenar un modelo mediante el envío de pares de frases para entrenar un modelo que posteriormente puedes usar para hacer traducciones sobre un dominio específico. Es el que más trabajo implicaría de tu parte pero es el que más flexibilidad de tiene.</li>\n</ul>\n\n<h3 id=\"ventajas\">Ventajas</h3>\n\n<p>Puedes olvidarte completamente de los detalles de implementación de la traducción, del hosting y mantenimiento de esta parte y probablemente las traducciones son muy precisas, como estamos acostumbrados a las de Google.</p>\n\n<h3 id=\"desventajas\">Desventajas</h3>\n\n<p>Generalmente esta comodidad viene un costo económico que varía dependiendo del uso. La flexibilidad y capacidad de configuración de las API’s es variada y si no funciona como esperas es muy probable que no puedas hacer nada por mejorar la traducción.</p>\n\n<h2 id=\"modelo-pre-entrenado-de-aprendizaje-de-máquina\">Modelo pre-entrenado de Aprendizaje de Máquina</h2>\n\n<p>Los modelos de Aprendizaje Profundo que se han desarrollado de manera importante en los últimos años han sustituido los modelos previos que utilizaban el conocimiento de lingüistas y décadas de investigación estadística.</p>\n\n<p>Una peculiaridad de un modelo de Aprendizaje Profundo es que logra detectar patrones de uso de los lenguajes y utilizar dichos patrones para realizar la traducción de uno a otro. Dichos patrones no tienen una representación equivalente de una palabra en un idioma a otra en un idioma distinto, sino que combinan los patrones internos de uso de las palabras en un idioma y después aplican los patrones que el otro idioma utilizaría. Eso hace que los traductores que utilizan aprendizaje profundo sean mucho más precisos y que las traducciones sean mucho más naturales, además de que pueden adaptarse a casos de uso específicos que los modelos anteriores no contemplaban. ¿Por qué? Porque podemos entrenarlos utilizando un conjunto de datos de entrenamiento que se enfoquen en un dominio específico del lenguaje (ej. traducción de subtítulos de películas, o traducción de textos técnicos).</p>\n\n<p>A pesar de ello, uno de los impedimentos más relevantes para su entrenamiento es que hasta hace algunos años, entrenar un modelo requería grandes cantidades de cómputo y memoria, cosa que ha ido cambiando conforme la industria ha ido evolucionando y los principales proveedores de cómputo han puesto a disposición del mundo, plataformas en la nube donde puede adquirirse poder computacional y de procesamiento de manera sencilla (AWS, Google, Microsoft, IBM, Oracle, etc.). De igual forma, las compañías que crean procesadores especializados (NVIDIA, AMD) también han logrado reducir los costos y poner en manos de cada vez más desarrolladores, tarjetas de video con Unidades de Procesamiento Gráfico (GPUs) a precios cada vez más accesibles.</p>\n\n<p>El modelo genérico de un sistema de traducción basado en Aprendizaje de Máquina consta de dos piezas principales (cada una de ellas una red neuronal por sí misma):</p>\n\n<ol>\n  <li>\n    <p>Un  codificador de secuencias de palabras (que serían oraciones del texto) que aprende a codificar palabras como un arreglo de números que representa el significado de la oración.</p>\n  </li>\n  <li>\n    <p>Un decodificador de números, que toma un arreglo de números en general y los transforma en oraciones.</p>\n  </li>\n</ol>\n\n<p>La peculiaridad es que en el paso 1 obtenemos ese arreglo de números utilizando el lenguaje de orígen y la decodificación la hacemos hacia el lenguaje destino.</p>\n\n<p>Para poder capturar los patrones y relaciones que existen entre las palabras en una oración, es necesario que la red neuronal cuente con la capacidad de recordar las palabras dentro de una oración, ya que las relaciones de una palabra cualquiera serán mucho más fuertes con ciertas palabras que con otras, por ejemplo la relación entre “la” y “relación” será mucho más fuerte que “él” y “relación”, no esperaríamos poder encontrar un texto donde “él” y “relación” estén presentes en dicho orden específico.</p>\n\n<p>Esta capacidad de “recordar” de una red neuronal no existe en una red neuronal tradicional, donde las entradas pasan y son procesadas por todas las capas de la red sin hacer referencia a las palabras que pasaron antes o las palabras que pasaron después, por ello es que estos algoritmos utilizan un tipo de red neuronal llamado recurrente donde la última entrada influye en la siguiente predicción, esto permite a la red neuronal recurrente “aprender” el “significado” de cada palabra dentro de un contexto.</p>\n\n<p>En tiempos recientes, se han mejorado los modelos de procesamiento del “significado” de las palabras dentro de un contexto utilizando Transformadores que van incluso más allá del simple contexto de una palabra dentro de una oración, modelando las relaciones cruzadas entre cualquier palabra (previa o posterior) en vez de considerar únicamente el orden.</p>\n\n<p>Estos modelos requieren mucho más operaciones matemáticas durante su entrenamiento pero los patrones que pueden identificar las hacen mucho más poderosas, aún así los modelos de recurrentes arrojan resultados bastante aceptables.</p>\n\n<p>Existen casos en particular donde no es necesario entrenar tu propia red neuronal recurrente, ya que es probable que alguien más lo haya hecho ya. Esto puede ahorrarte muchas horas de procesamiento de información y el entrenamiento y validación del proceso de entrenamiento.</p>\n\n<p>El proceso que se sigue es:</p>\n\n<ol>\n  <li>Obtener un corpus o conjunto de datos sobre el problema que quieres resolver (por ejemplo, textos en el idioma de origen y en el idioma destino.</li>\n  <li>Limpieza y normalización de este corpus que remueva errores o piezas de los textos que sean incompletas o por ejemplo se puede decidir utilizar todas las palabras en minúsculas, separar las oraciones por ciertos símbolos de puntuación, etc. estas decisiones deberán tomarse teniendo en cuenta los objetivos para los cuales utilizaremos nuestro modelo de traducción, no es lo mismo un traductor de textos formateados de manera regular a textos que por ejemplo se vayan a utilizar como subtítulos para películas. Los pasos que normalmente se utilizarán tendrán como mínimo, código para separar las oraciones, y normalizar el texto.</li>\n</ol>\n\n<h3 id=\"utilizando-un-modelo-de-traducción-prefabricado\">Utilizando un modelo de traducción prefabricado</h3>\n\n<p>Si quieres experimentar con este tipo de modelos te recomiendo empezar por el uso de un modelo pre-entrenado y dependiendo de los resultados evaluar si es necesario entrenar uno especializado en la tarea que estás buscando resolver.</p>\n\n<p>Aunque hay varios modelos disponibles, te dejo la liga a un framework hecho en C++ y que tiene un número mínimo de dependencias, se llama <a href=\"https://marian-nmt.github.io/quickstart/\">Marian Neural Machine Translation</a> y como parte de sus peculiaridades es que es eficiente, puede utilizar varios procesadores gráficos para el entrenamiento y soporta el uso de CPU o GPU para la traducción (al poder utilizar sólo CPU hace que el modelo pueda utilizarse en computadoras que no tienen tantos recursos).</p>\n\n<p>Y aquí hay un modelo pre-entrenado que puede utilizarse para traducciones de español a inglés: <a href=\"https://github.com/ageitgey/spanish-to-english-translation\">Spanish to English Translation</a></p>\n\n<p>Si tuvieras necesidad de entrenar la red neuronal sería necesario que tuvieras datos paralelos, es decir el mismo texto en los dos idiomas entre los cuales quieres hacer la traducción. Aquí te dejamos la liga a uno de ellos: <a href=\"http://opus.nlpl.eu/\">The open parallel corpus</a></p>\n\n<h3 id=\"ventajas-1\">Ventajas</h3>\n\n<ul>\n  <li>Puede adaptarse mediante el entrenamiento, a un estilo o tipo específico de textos (textos científicos, técnicos, informales, subtítulos, etc.)</li>\n  <li>Puede utilizarse en modo “offline” sin necesidad de estar conectado a alguna fuente externa de internet.</li>\n  <li>No tiene costos o límites de uso, más que aquellos resultado de operar el modelo una vez entrenado (y de entrenarlo si fuera necesario hacerlo).</li>\n</ul>\n\n<h3 id=\"desventajas-1\">Desventajas</h3>\n\n<ul>\n  <li>Entrenarlo requiere una gran cantidad de datos y un proceso de limpieza/normalización que no son técnicamente sencillos.</li>\n  <li>Es probable que no sea sencillo alcanzar el nivel de entrenamiento que las grandes compañías han utilizado para entrenar sus propios modelos (porque seguramente tienen fuentes bastante grandes de datos/procesadores gráficos/etc).</li>\n  <li>Escalarlo para su uso masivo puede ser todo un reto.</li>\n  <li>Las redes neuronales son cajas negras por lo que si se detecta algún error en la traducción normalmente será muy difícil saber en qué parte de los datos de entrenamiento se introdujo el error y por lo tanto será difícil removerlo.</li>\n</ul>\n\n<p>En el siguiente artículo te contaremos cómo nos fue con las pruebas.</p>\n",
      "date_published": "Sun, 19 Jul 2020 00:00:00 -0500"
      },
    
    {
      "id": "http://localhost:4000/2020/07/16/de-bash-a-zsh.html",
      "url": "http://localhost:4000/2020/07/16/de-bash-a-zsh.html",
      "title": "De Bash a Zsh",
      "content_html": "<p>Con la reciente liberación de MacOS Catalina, Apple anunció que entre alguno de los cambios al sistema operativo, se utilizará a partir de esta versión un nuevo <em>shell</em> que de manera regular se utilizaba en la app Terminal y en otras aplicaciones utilizadas por los desarrolladores para interactuar con la Mac a través de la línea de comandos.</p>\n\n<p>El shell que se utilizaba previo a esta versión era <strong>Bash</strong> (<em>Bourne Again Shell</em>) y el que se utilizará ahora es <strong>Zsh</strong>.</p>\n\n<h2 id=\"qué-es-un-shell\">¿Qué es un shell?</h2>\n\n<p>En resumen, un shell es un programa que permite <strong>controlar la computadora a través de comandos de texto</strong>, normalmente se trata de interfaces de texto interactivo, donde el usuario podrá ir <strong>tecleando comandos para obtener información</strong> o ejecutar comandos y obtener resultados a través de la misma interfaz.</p>\n\n<p>A lo largo de la historia se han creado diferentes shells, cada uno con una serie de comandos que ponen a disposición de los usuarios <strong>funcionalidades específicas</strong> de sus sistemas operativos. ¿Y porqué estaría alguien interesado en usar un shell y una línea de comandos para controlar una computadora? Para entenderlo hay que viajar un poco en el tiempo.</p>\n\n<h3 id=\"historia\">Historia</h3>\n\n<p>Inicialmente, controlar una computadora era una tarea difícil, las primeras de ellas se controlaban mediante diferentes dispositivos (interruptores, tarjetas perforadas, etc.) que “cargaban” en memoria las distintas piezas de información que serían procesados en forma de programas. Este proceso era regularmente <strong>tedioso y sujeto a errores</strong>.</p>\n\n<p>En algunos casos, el primer programa que se cargaba en memoria era un programa que permitía cargar instrucciones adicionales a través de la lectura de datos en las mismas tarjetas perforadas. De igual forma, los resultados de la ejecución normalmente se plasmaban en papel o tarjetas similares a las que se utilizaban para su carga.</p>\n\n<p>Conforme fueron evolucionando los computadores, los programas permitieron el uso de dispositivos de entrada más amigables para el usuario de la computadora, como Teletipos, que permitían enviar comandos desde teclados y terminales remotas al ordenador (remoto en un sentido práctico, quizás de un cuarto a otro). Esta forma de transmitir comandos y obtener resultados era mucho más sencilla que estar cargando información a través de interruptores o tarjetas perforadas.</p>\n\n<p>La pregunta natural es: si esto fue la primer evolución hacia un uso más sencillo de las computadoras, <strong>¿por qué se sigue utilizando?</strong></p>\n\n<p>Aunque la evolución de las computadoras ha seguido su curso y la interacción Humano-Computador ha avanzado en diferentes vertientes, por ejemplo, <strong>mediante la implementación de interfaces gráficas</strong>, el uso de la interfaz de línea de comandos se ha mantenido vigente por diversas razones:</p>\n\n<ol>\n  <li>\n    <p>Por su <strong>versatilidad</strong>, es posible utilizarlo para resolver distintos tipos de problemas y con distintos tipos de opciones que harían muy difícil su integración completa en una interfaz gráfica.</p>\n  </li>\n  <li>\n    <p>Por su <strong>poder</strong>, al tener acceso a las funciones centrales del sistema operativo, también contempla casos de uso para los cuales las interfaces gráficas no están preparados.</p>\n  </li>\n  <li>\n    <p>Permite crear programas que hacen uso de las capacidades nativas y extendidas del sistema operativo y ejecutar dichos programas o scripts en distintas modalidades, por ejemplo, de manera repetitiva a través de trabajos programados (cron jobs) o en conjunto con otros programas (por ejemplo con ambientes de desarrollo integrados). A esto le podemos llamar <strong>automatización de tareas</strong>.</p>\n  </li>\n</ol>\n\n<p>El programa de shell específico (en este caso Bash o Zsh), definen su interfaz con el usuario, no sólo en la manera en la que presentarán la linea de comando sino también en las <strong>capacidades y comandos que soportan de manera nativa</strong>, en general, podemos encontrar algunas de estas características:</p>\n\n<ul>\n  <li>Una sintaxis que define los comandos y secuencias de comando que el shell ‘entenderá’.</li>\n  <li>Comandos que darán acceso a las ‘operaciones’ que el shell puede ejecutar .</li>\n  <li>Funciones que permiten agrupar comandos para ejecutar labores más complejas.</li>\n  <li>Parámetros para almacenar valores para su uso durante la ejecución de las funciones y comandos.</li>\n  <li>Expansión que define la forma en la que los parámetros en un comando son aplicados.</li>\n  <li>Flujo y redirección que controla las entradas y salidas de y desde los comandos.</li>\n  <li>Ejecución que define lo que sucede cuando cada comando corre.</li>\n  <li>Scripting que permite ejecutar archivos que contienen una lista de comandos y/o funciones.</li>\n</ul>\n\n<h2 id=\"porqué-razón-puede-estar-cambiando-apple-de-un-shell-a-otro\">¿Porqué razón puede estar cambiando Apple de un shell a otro?</h2>\n\n<p>Existen varias posibilidades, la primera de ellas es que aunque Apple utiliza Bash desde OSX Jaguar, no había actualizado Bash desde la versión 3.2 liberada en el 2007, es decir casi el mismo año en el que se liberó el primer iPhone. Es probable que una de las razones por las que esto sucedió fue que Bash cambió su licencia de uso de <strong>GNU GPL 2 a una licencia GNU GPLv3</strong>, y dicho cambio incluía restricciones que quizás no fueron del todo favorables a Apple.</p>\n\n<p>Así que migrar a Zsh es una opción refrescante. La versión que está incluida en Catalina es la 5.7.1 y utiliza una versión de licenciamiento <strong>MIT que es menos restrictiva que la GPLv3</strong>.</p>\n\n<h2 id=\"qué-sucederá-con-bash-tendré-que-dejar-de-usarlo\">¿Qué sucederá con Bash, tendré que dejar de usarlo?</h2>\n\n<p>No necesariamente, aunque Zsh será el shell por default para todas las nuevas cuentas de usuario creadas en macOS Catalina, si tu hiciste un upgrade del Sistema Operativo, tu cuenta seguirá utilizando por default Bash. Pero siempre tendrás opción de configurar el shell que desees por default de manera voluntaria, incluso a alguno distinto a Zsh o Bash.</p>\n\n<p>A nivel general, Bash y Zsh tienen un nivel de compatibilidad bastante alto ya que <strong>ambos están basados en el aún más antiguo Bourne Shell</strong>, de tal forma que la mayoría de los scripts y comandos existentes funcionarán sin ningún cambio en Zsh.</p>\n\n<p>La ventaja real de Zsh es la inclusión de funcionalidades que hacen trabajar con él más fácil (funcionalidades no incluidas por default en la versión vieja de Bash), entre algunas de mis funcionalidades favoritas están:</p>\n\n<ul>\n  <li>Auto completado de comandos</li>\n  <li>Auto corrección de comandos</li>\n  <li>Integración con algunos sistemas de uso común para desarrolladores (git)</li>\n</ul>\n\n<h2 id=\"qué-sucederá-con-mis-scripts-hechos-en-bash\">¿Qué sucederá con mis scripts hechos en Bash?</h2>\n\n<p>En general, correrán de igual forma a como lo venían haciendo, sin embargo en casos muy peculiares podrías requerir modificarlos o simplemente agregar #!/bin/bash (<em>shebang</em>) para forzar a que el script utilice el shell de Bash que sigue incluyéndose en MacOS.</p>\n\n<p>Puedes usar temporalmente uno u otro shell simplemente invocando su nombre en la línea de comandos (<code class=\"language-plaintext highlighter-rouge\">zsh</code> o <code class=\"language-plaintext highlighter-rouge\">bash</code>).</p>\n\n<p>En la Mac, podrás configurar el shell default en las Preferencias del Sistema, en el panel de Usuarios y Grupos, podrás seleccionar la cuenta de un usuario y en las Opciones Avanzadas podrás seleccionar uno de los shells disponibles.</p>\n\n<h2 id=\"conclusión-y-referencias\">Conclusión y referencias</h2>\n\n<p>Dominar tu shell <strong>hará que tu trabajo diario sea más sencillo</strong> ya que podrás configurar funcionalidades que aumenten tus capacidades como desarrollador y en conjunto con el conocimiento a profundidad de tu interfaz de desarrollo, podrá hacerte mucho más eficiente al momento de administrar y ejecutar comandos que tengan que ver con tus proyectos.</p>\n\n<p>Algunos recursos que te ayudarán:</p>\n\n<ul>\n  <li>La <a href=\"http://zsh.sourceforge.net/\">documentación de Zsh</a></li>\n  <li>Configuración Zsh es mediante <a href=\"https://ohmyz.sh/\">Oh My Zsh</a></li>\n  <li>¿Donde se configuran las funcionalidades de Zsh? En <code class=\"language-plaintext highlighter-rouge\">~/.zshrc</code>.</li>\n  <li>¿Cómo  saber que shell estoy usando?</li>\n</ul>\n\n<div class=\"language-bash highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code><span class=\"nb\">echo</span> <span class=\"nv\">$0</span>\n</code></pre></div></div>\n<p>o</p>\n\n<div class=\"language-bash highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code><span class=\"nb\">echo</span> <span class=\"nv\">$SHELL</span>\n</code></pre></div></div>\n\n<ul>\n  <li>¿Cómo configurar Zsh como mi shell default?</li>\n</ul>\n\n<div class=\"language-bash highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>chsh <span class=\"nt\">-s</span> /bin/zsh\n</code></pre></div></div>\n\n<ul>\n  <li>¿Cómo activar el autocomplete?</li>\n</ul>\n\n<div class=\"language-bash highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>autoload <span class=\"nt\">-U</span> compinit <span class=\"o\">&amp;&amp;</span> compinit\n</code></pre></div></div>\n\n<ul>\n  <li>¿Cómo activar la extensión para git?</li>\n</ul>\n\n<div class=\"language-bash highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>autoload <span class=\"nt\">-Uz</span> vcs_info\n</code></pre></div></div>\n\n<ul>\n  <li>¿Cómo configurar el cambio de directorio automático?\n    <div class=\"language-bash highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>setopt autocd\n</code></pre></div>    </div>\n  </li>\n</ul>\n\n<h3 id=\"referencias\">Referencias</h3>\n\n<ul>\n  <li><a href=\"https://www.bash.academy/\">Bash academy</a></li>\n  <li><a href=\"https://news.ycombinator.com/item?id=10737639\">Discusión en YCombinator</a></li>\n  <li><a href=\"http://www.rayninfo.co.uk/tips/zshtips.html?LMCL=bNg6o6\">Zsh tips</a></li>\n  <li><a href=\"http://leahneukirchen.org/blog/archive/2008/02/10-zsh-tricks-you-may-not-know.html\">10 trucos de Zsh</a></li>\n  <li><a href=\"http://zsh.sourceforge.net/Guide/zshguide.html\">Zsh Guide</a></li>\n  <li><a href=\"http://www.tldp.org/LDP/abs/html/\">Advanced Bash-Scripting Guide</a></li>\n  <li><a href=\"http://matt.might.net/articles/bash-by-example/\">Bash by example</a></li>\n  <li>Libro: <a href=\"https://amzn.to/32phs95\">From Bash to Zsh</a></li>\n</ul>\n",
      "date_published": "Thu, 16 Jul 2020 00:00:00 -0500"
      },
    
    {
      "id": "http://localhost:4000/2020/07/15/recursos-para-aprender-arquitectura-de-software.html",
      "url": "http://localhost:4000/2020/07/15/recursos-para-aprender-arquitectura-de-software.html",
      "title": "Recursos para aprender Arquitectura de Software",
      "content_html": "<p>Tuvimos una plática con <a href=\"https://twitter.com/machinesareus\">Agustín Ramos</a> acerca de la arquitectura de software y lo que debes aprender para practicarla. Este pequeño artículo incluye nuestro resumen y las recomendaciones de Agustín.</p>\n\n<h2 id=\"qué-es-la-arquitectura-de-software\">¿Qué es la arquitectura de software?</h2>\n\n<p>La arquitectura del software incluye el <strong>diseño del sistema</strong> a alto nivel: la descomposición del sistema en módulos, la descripción de las responsabilidades de cada uno y sus relaciones.</p>\n\n<p>También incluye las prácticas y herramientas que permitirán que el proyecto cumpla con los <strong>atributos de calidad</strong> o requerimientos no funcionales.</p>\n\n<p>Todo lo anterior está basado en un análisis de las <em>funciones</em> y <em>atributos de calidad</em> del sistema.</p>\n\n<h1 id=\"el-proceso\">El proceso</h1>\n\n<p>En la plática tocamos 5 etapas del desarrollo de una arquitectura:</p>\n\n<ol>\n  <li>\n    <p><strong>Descubrimiento y definición de los atributos de calidad.</strong> Básicamente consiste en entender el problema, escuchar a todos los involucrados en el proyecto y definir los atributos del software que no están directamente relacionados con la funcionalidad, pero que debe de cumplir.</p>\n  </li>\n  <li>\n    <p><strong>Diseño del sistema.</strong> Generalmente te ayudarás de estilos de arquitectura y patrones de diseño para llegar a los objetivos funcionales y no funcionales.</p>\n  </li>\n  <li>\n    <p><strong>Validación del diseño.</strong> Mediante la creación de prototipos se puede validar que las asunciones principales acerca del diseño y su relación con los atributos de calidad se cumplen. Esto puede derivar en <em>cambios</em> sobre el diseño que lo mejoren.</p>\n  </li>\n  <li>\n    <p><strong>Comunicación del diseño.</strong> Después de definir la arquitectura</p>\n  </li>\n  <li>\n    <p><strong>Seguimiento del diseño.</strong> Esto incluye varias cosas:</p>\n    <ul>\n      <li><em>Verificación de que el equipo está siguiendo el diseño.</em> Esto se logra con revisiones constantes con el equipo: programación en parejas y revisión de código.</li>\n      <li><em>El diseño nunca está está escrito en piedra</em>. Después de las revisiones de código se descubrirán cosas que no están funcionando como se esperaba, por lo que será necesario modificar el diseño y dejar registro de los cambios y las decisiones tomadas.</li>\n    </ul>\n  </li>\n</ol>\n\n<h2 id=\"consejos-específicos\">Consejos específicos</h2>\n\n<p>Los arquitectos de software deben encontrar la solución más simple posible porque si no va a ser rígida.</p>\n\n<p>Acerca de la <strong>documentación</strong>, Agustín recomienda, exponerla al equipo en una junta y hacer un video de esto, que se le pase a cada integrante del equipo. Se puede seguir el marco llamado <a href=\"https://www.cs.ubc.ca/~gregor/teaching/papers/4+1view-architecture.pdf\">“Arquitectura 4 + 1”</a> que se compone de:</p>\n\n<ul>\n  <li>Vista de Componentes</li>\n  <li>Vista de Desarrollo</li>\n  <li>Vista de Procesos</li>\n  <li>Vista Física</li>\n  <li>Vista de Casos (Este es el +1)</li>\n</ul>\n\n<p>Además, tenemos que mantener una bitácora de los cambios y los factores que los impulsaron, esto puede ser mediante los <a href=\"https://adr.github.io/\">Architectural decisión Records</a></p>\n\n<h2 id=\"cómo-empezar\">Cómo empezar</h2>\n\n<p>Agustín nos recomendó algunos recursos para que empieces a aprender:</p>\n\n<ul>\n  <li><a href=\"https://www.goodreads.com/book/show/179204.Object_Design?from_search=true&amp;from_srp=true&amp;qid=3yFmpRp03n&amp;rank=6\">Object Design - Rebecca Wirfs-Brock</a></li>\n  <li><a href=\"https://www.goodreads.com/book/show/70143.Software_Architecture_in_Practice?from_search=true&amp;from_srp=true&amp;qid=mnXRSoVML7&amp;rank=1\">Software Architecture in Practice</a></li>\n  <li>Como alternativa al libro anterior  se recomienda Technical Report sobre arquitectura del Software Engineering Institute, encontré varios, tienes un ejemplo <a href=\"https://pure.au.dk/portal/files/20484966/tech-report-5.pdf\">aquí</a>.</li>\n  <li><a href=\"https://pragprog.com/titles/mkdsa/\">Design it! - Micheal Keeling</a></li>\n  <li>La serie <a href=\"\">Pattern-orinted Software Architecture</a></li>\n</ul>\n\n<p>Para aprender patrones de diseño se habló de los siguientes libros:</p>\n\n<ul>\n  <li><a href=\"https://www.amazon.com.mx/dp/0201633612?tag=amz-mkt-chr-mx-20&amp;ascsubtag=1ba00-01000-a0087-mac00-other-nomod-mx000-pcomp-feature-scomp-wm-5&amp;ref=aa_scomp\">Patrones de Diseño - Erich Gamma, et Al.</a></li>\n  <li><a href=\"https://www.amazon.com/Patterns-Handbook-Techniques-Strategies-Applications/dp/0521648181\">The patterns handbook</a></li>\n  <li>La serie <a href=\"https://www.amazon.com.mx/Pattern-Languages-Program-Design-Coplien/dp/0201607344/ref=sr_1_3?dchild=1&amp;keywords=Pattern+Languages+of+Program+Design&amp;qid=1594823984&amp;s=books&amp;sr=1-3\">Pattern language of program design (5 libros)</a></li>\n</ul>\n\n<p>Y entre los libros que se mencionan como la fuente de las ideas de patrones y diseño:</p>\n\n<ul>\n  <li><a href=\"https://www.amazon.com.mx/Phenomenon-Life-Building-Nature-Universe/dp/0972652914/ref=pd_sim_14_1/132-2199838-9714154?_encoding=UTF8&amp;pd_rd_i=0972652914&amp;pd_rd_r=43c91cc2-6447-4629-a6d7-fb29dc8fd2d7&amp;pd_rd_w=gNuac&amp;pd_rd_wg=g8gOe&amp;pf_rd_p=a62f455d-612d-4136-9fd7-44067fe2cd11&amp;pf_rd_r=86FX03JZ655BENFVMSC0&amp;psc=1&amp;refRID=86FX03JZ655BENFVMSC0\">The nature of order de Christopher Alexander</a> y los otros libros de él como <a href=\"https://www.amazon.com.mx/Professor-Department-Architecture-Christopher-Alexander/dp/0195024028/ref=pd_sim_14_3/132-2199838-9714154?_encoding=UTF8&amp;pd_rd_i=0195024028&amp;pd_rd_r=c4dd6dad-be5f-4a11-a037-a4ecd8f56915&amp;pd_rd_w=CYjKZ&amp;pd_rd_wg=x61DA&amp;pf_rd_p=a62f455d-612d-4136-9fd7-44067fe2cd11&amp;pf_rd_r=JWAJ48WRNHYPDZ8RC2R1&amp;psc=1&amp;refRID=JWAJ48WRNHYPDZ8RC2R1\">A timeless way of building</a></li>\n  <li><a href=\"https://www.amazon.com.mx/Art-Scalability-Architecture-Organizations-Enterprise/dp/0134032802/ref=sr_1_1?__mk_es_MX=%C3%85M%C3%85%C5%BD%C3%95%C3%91&amp;dchild=1&amp;keywords=the+art+of+scalability&amp;qid=1594824264&amp;s=books&amp;sr=1-1\">The art of Scalability</a></li>\n</ul>\n\n<h2 id=\"el-capítulo\">El capítulo</h2>\n\n<p>De todos modos no te pierdas el capítulo, que estuvo muy bueno:</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/vfu5PsSH7us\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n\n",
      "date_published": "Wed, 15 Jul 2020 00:00:00 -0500"
      },
    
    {
      "id": "http://localhost:4000/2020/07/09/que-es-el-pensamiento-computacional.html",
      "url": "http://localhost:4000/2020/07/09/que-es-el-pensamiento-computacional.html",
      "title": "¿Qué es el pensamiento computacional?",
      "content_html": "<p>Todo lo relacionado con el <strong>pensamiento computacional</strong> (la programación, la inteligencia artificial, las computadoras) ha estado muy presente en la mente de la sociedad, porque vivimos en un mundo en el que <em>cada aspecto de la vida</em> se ha visto influenciado por lo que la computación permite.</p>\n\n<p>En varios lugares del mundo se ha pensado que se debe agregar el pensamiento computacional a la educación básica que todos reciben, bajo la promesa de que mejorará en general la <strong>capacidad de pensar y resolver problemas</strong>.</p>\n\n<p>Hablemos de qué es el pensamiento computacional y cómo te puede ayudar a comprender mejor el mundo creado con la ayuda de las computadoras.</p>\n\n<h2 id=\"qué-es-el-pensamiento-computacional\">¿Qué es el pensamiento computacional?</h2>\n\n<p>No hay una definición clara, y todo el tiempo está cambiando lo que se entiende por este término, pero podemos dar una definición decente como la <strong>habilidad mental</strong> y las prácticas que nos permiten <em>diseñar cálculos</em> para que las computadoras realicen un trabajo.</p>\n\n<p>Otra acepción es la capacidad de entender el mundo como un <strong>complejo de procesos de información</strong>.</p>\n\n<p>Estas dos habilidades combinadas pueden ayudarte a resolver muchos problemas y a navegar mejor el mundo moderno.</p>\n\n<p>Por ejemplo, para tener la capacidad de diseñar algoritmos para las computadoras modernas debes entender las bases del funcionamiento y eso necesariamente te llevará a entender sus <strong>limitaciones y fortalezas</strong>, lo cuál te llevará a evitar que te engañen fácilmente.</p>\n\n<p>Tener conocimiento de las capacidades además nos hace conscientes de lo que una empresa o gobierno con los suficientes recursos puede lograr en los campo de manipulación y colección de datos, inteligencia artificial, <strong>vigilancia</strong>, seguridad e influencia sobre los pensamientos colectivos.</p>\n\n<p>El pensamiento computacional ha avanzado en por lo menos <strong>seis áreas</strong>. Veamos lo que estas abarcan.</p>\n\n<h2 id=\"métodos-computacionales\">Métodos computacionales</h2>\n\n<p>Los matemáticos e ingenieros a lo largo de la historia han buscado desarrollar métodos para hacer <strong>más eficientes los cálculos y poder calcular más cosas automáticamente</strong>. Esto ha permitido que calculemos cosas que en cierto tiempo se creían imposibles.</p>\n\n<p>Gran parte del trabajo que se ha realizado está dedicado a que los cálculos se puedan realizar sin entendimiento e intuición. Es por eso que se han ido desarrollando áreas de las matemáticas que tienen que ver directamente con esto:</p>\n\n<ul>\n  <li>La lógica</li>\n  <li>El álgebra booleana</li>\n  <li>La teoría de autómatas.</li>\n</ul>\n\n<p>Todo esto es con el objetivo de realizar <strong>cálculos libres de errores</strong> lo más rápidamente posible. Algunas de las tareas principales que los métodos de cómputo incluyen son:</p>\n\n<ul>\n  <li>Descomposición de problemas en problemas más sencillos</li>\n  <li>Distribución de la ejecución de los cálculos en diferentes tiempos y ejecutores</li>\n  <li>Chequeo y corrección de errores</li>\n  <li>Representación de información</li>\n</ul>\n\n<h2 id=\"máquinas\">Máquinas</h2>\n\n<p>La computación está casada con un <em>medio</em> que ejecute los cálculos. Estas son las computadoras, que han variado con el paso del tiempo.</p>\n\n<p>La principal motivación de buscar máquinas automáticas que realizaran los cálculos es eliminar los <strong>problemas inherentes</strong> a los cálculos realizados por humanos: son lentos y propensos a errores.</p>\n\n<p>Los medios en los que se ejecutan los cálculos han ido evolucionando hasta llegar a los microprocesadores que tenemos hoy que pueden realizar una infinidad de cálculos en poco tiempo.</p>\n\n<p>Para diseñar y trabajar con estas máquinas, se tienen que entender muchos conceptos, que el pensamiento computacional trata:</p>\n\n<ul>\n  <li>Representación de información digitalmente y señales eléctricas como códigos binarios</li>\n  <li>Diseño de circuitos</li>\n  <li>Temporización con reloj de los cálculos</li>\n  <li>Control de flujo</li>\n  <li>Loops</li>\n  <li>Memoria digital</li>\n  <li>Espacios de memoria</li>\n  <li>Aislamiento de procesos</li>\n  <li>Tolerancia a fallos</li>\n</ul>\n\n<p>Todo esto está casado con el concepto de computadora digital que tenemos hoy (el modelo de von Neumann), pero <strong>existen otro tipo de computadoras</strong> que no ejecutan cálculos en la misma forma.</p>\n\n<p>Dos ejemplos de esto son las redes neuronales y las computadoras cuánticas, que no necesitan una serie de “pasos” para resolver los cálculos y tienen un tipo de pensamiento computacional completamente diferente.</p>\n\n<p>Es en este punto en donde la computación deja de ser un campo específicamente de las matemáticas y la lógica, ya que los cálculos y los procedimientos realizados están <strong>estrechamente ligados al medio de ejecución</strong>.</p>\n\n<p>De este apartado lo último que tenemos que mencionar es que toda la revolución del mundo que vemos hoy causada por las computadoras está causada por la <strong>gran velocidad</strong> que las computadoras han alcanzado. Sin esto, que es difícil de comprender (ve la cita de abajo), no podríamos ver todo lo que las computadoras han causado hoy.</p>\n\n<blockquote>\n  <p>154,300,000,000 de operaciones por segundo en el procesador del iPhone 11 Pro.</p>\n</blockquote>\n\n<h2 id=\"educación-de-ciencias-de-la-computación\">Educación de ciencias de la computación</h2>\n\n<p>Difundir el conocimiento para crear procedimientos que las computadoras automáticas puedan ejecutar es una de las principales tareas y <em>responsabilidades</em> del pensamiento computacional.</p>\n\n<p>Al ser una combinación de ingeniería, matemáticas y ciencia la computación nació como un campo nuevo de estudios que tomó tiempo en ser reconocido y abrazado como una ciencia más.</p>\n\n<p>Las ciencias de la computación han sido entendidas de diferentes formas a lo largo del tiempo:</p>\n\n<ol>\n  <li>Como los fenómenos que rodean a las computadoras</li>\n  <li>Entendiendo la programación como un arte y una ciencia</li>\n  <li>Computación == Automatización</li>\n  <li>Entendimiento del universo como una computadora gigantezca</li>\n</ol>\n\n<p>Estas etapas del entendimiento de las ciencias de la computación han modificado la forma en que el pensamiento computacional es entendido.</p>\n\n<h2 id=\"ingeniería-del-software\">Ingeniería del Software</h2>\n\n<p>El software son los programas que las computadoras digitales modernas ejecutan para realizar los cálculos que les permiten realizar todas las tareas a las que estamos acostumbrados.</p>\n\n<p>La <strong>construcción de software</strong> es una da las tareas más importantes que se relacionan con el pensamiento computacional. Lo más importante de esta área es la entrega confiable de software listo para entornos de la vida real (<em>de producción</em>), que tiene las siguientes características:</p>\n\n<ul>\n  <li>Confiable (no falla constantemente)</li>\n  <li>Usable (cumple con su función, a una velocidad adecuada)</li>\n  <li>Seguro (no causa daños y no se puede robar información)</li>\n</ul>\n\n<p>Hacer software con estas características es una tarea súmamente difícil por la complejidad que implica.</p>\n\n<p>La ingeniería es “la aplicación de las matemáticas y la ciencia a los problemas de las personas”. Así, la ingeniería de software busca establecer <strong>técnicas y procedimientos para desarrollar software correcto</strong>.</p>\n\n<p>Además la ingeniería del software ha buscado desarrollar herramientas que faciliten el desarrollo de software. Es un área muy compleja del pensamiento computacional que está constante evolución y el principal problema de la industria del software actual.</p>\n\n<h2 id=\"diseño-de-software\">Diseño de Software</h2>\n\n<blockquote>\n  <p>El buen diseño produce un objeto que funciona para las personas en un contexto de necesidades y valores, para producir resultados de calidad y una <strong>experiencia satisfactoria</strong>. - Terry Winograd</p>\n</blockquote>\n\n<p>El software muchas veces está hecho para interactuar con personas. La tarea del diseñador de software es diseñar programas que <strong>resuelvan los problemas de los usuarios</strong>.</p>\n\n<p>Esto tiene que ver con la forma de usarlo, las interfaces que presentará a los usuarios, las funciones, las actualizaciones, la protección de información, los medios de presentación y muchas más tareas relacionadas con <strong>crear software que deleite al usuario</strong>.</p>\n\n<p>La principal diferencia con la ingeniería de software es que mientras la ingeniería está pensada desde el punto de vista <strong>del programador</strong>, el diseño está pensado desde el punto de vista <strong>del usuario</strong>.</p>\n\n<p>Es decir, la ingeniería asegura que el programa funciona como el programador desea, el diseño asegura que el programa hace lo que el usuario necesita.</p>\n\n<h2 id=\"ciencia-computacional\">Ciencia computacional</h2>\n\n<p>La ciencia ha sido completamente revolucionada por lo que la computación electrónica automática permite, desde grandes cantidades de cálculos en poco tiempo hasta simulaciones de los procesos naturales.</p>\n\n<p>Desde que la computación automática existe, ha sido una gran ayuda para llegar a lugares que no se había siquiera podido soñar. Incluso se han creado <strong>nuevas ciencias</strong>, que son la combinación de una ciencia tradicional con la computación como “Biología computacional”.</p>\n\n<p>Pero la ciencia computacional requiere su <strong>propio tipo de pensamiento computacional</strong>, desde los métodos hasta el software creado. No se aplican las misma técnicas ni herramientas que para el software no usado en la ciencia. Es por eso que el uso de la computación en las ciencias he hecho <strong>avanzar a la computación</strong>.</p>\n\n<p>Otro aspecto del pensamiento computacional en la ciencia es el uso del conocimiento de los procesos de información para <strong>interpretar el mundo natural como una conexión muchos modelos de información</strong>. Esto nos revela que la computación ha influido incluso en la manera en la que vemos el mundo.</p>\n\n<h2 id=\"conclusión\">Conclusión</h2>\n\n<p>El pensamiento computacional es mucho más complejo de lo que parece o de los que los medios han entendido (“hacer algoritmos”).</p>\n\n<p>Este campo del pensamiento es tan grande que no alcanzaría una vida para cubrirlo en su totalidad, pero podemos tener una idea general de los campos que abarca y si nos gusta, especializarnos en uno de ellos.</p>\n\n<hr />\n<p>Este artículo está basado en el libro <a href=\"https://mitpress.mit.edu/books/computational-thinking\">Computational Thinking</a> de Peter J. Denning y Matti Tedre.</p>\n",
      "date_published": "Thu, 09 Jul 2020 00:00:00 -0500"
      },
    
    {
      "id": "http://localhost:4000/2020/06/02/resumen-que-hacer-para-conseguir-un-buen-trabajo-como-programador.html",
      "url": "http://localhost:4000/2020/06/02/resumen-que-hacer-para-conseguir-un-buen-trabajo-como-programador.html",
      "title": "Resumen: Qué hacer para conseguir un buen trabajo como programador",
      "content_html": "<p>= ¿Qué hacer para conseguir un buen trabajo en tecnología?</p>\n\n<p>-&gt; Intro por Alex</p>\n\n<p>-&gt; Cuente Pablo de su trayectoria\n-&gt; Trayectoria de Diego</p>\n\n<p>-&gt; ¿Consideras que donde estás ahora o donde estuviste en tu último trabajo\nes donde querías estar? ¿O en qué punto te diste cuenta?</p>\n\n<p>-&gt; Sabemos que los dos han trabajado con gente de otros países. En qué les ha ayudado eso para mejorar como desarrolladores</p>\n\n<p>-&gt; Qué diferencias básicas hay entre la cultura de trabajo de empresas exitosas y la general en LATAM.</p>\n\n<p>-&gt; Cómo es el día a día de un desarrollador en una FAANG</p>\n\n<p>-&gt; Cuáles son las 3 habilidades básicas que creen que todo desarrollador debe tener para mantenerse empleable y cada vez con mejores responsabilidades (y por lo tanto sueldo)</p>\n\n<p>-&gt; Qué tanto se ocupan las siguientes herramientas:\n    -&gt; Matemáticas\n    -&gt; Algoritmos\n    -&gt; Estructuras de datos\n    -&gt; Otras bases de CS</p>\n\n<p>-&gt; Qué tanto se ocupan las habilidades blandas</p>\n\n<p>-&gt; Hay cursos de todo ahora mismo, pero ahora llama curso a todo, cuándo consideran que vale la pena llamar a algo un curso para no devaluar las palabras.</p>\n\n<p>-&gt; Cosas de alto nivel contra cosas de bajo nivel. Python vs C++\n-&gt; Diego: Qué opinas de JS</p>\n\n<p>-&gt; Aprende Inglés\n-&gt; Aprende a recibir y dar feedback</p>\n\n<p>Libros:</p>\n\n<ul>\n  <li>Pragmatic Programmer</li>\n  <li></li>\n  <li>Fundamentos</li>\n</ul>\n\n<p>Pablo:</p>\n\n<ul>\n  <li>Presente en el aprendizaje - 5 why?</li>\n  <li>Ser crítico</li>\n  <li>Aprender - ser</li>\n</ul>\n\n<p>Diego:</p>\n\n<ul>\n  <li>Resiliencia: Los problemas nunca van a parar</li>\n  <li>Resolver problemas: para eso te contrataron</li>\n  <li>Ser agnóstico</li>\n</ul>\n\n<p>Tres cosas para Google:</p>\n\n<ul>\n  <li>Dificultad</li>\n  <li>Liderazgo</li>\n  <li>Impacto</li>\n  <li>Independencia</li>\n  <li>Ownership</li>\n  <li>Estar presente</li>\n</ul>\n\n<p>Feedback</p>\n\n<ul>\n  <li>Directo</li>\n  <li>Accionable</li>\n  <li>Oportuno</li>\n  <li>Transparente</li>\n</ul>\n\n<p>The Cherno</p>\n\n<p>Pablo Trinidad</p>\n\n<p>Computerphile</p>\n\n<p>Pablo Trinidad</p>\n\n<p>Numberphile</p>\n\n<p>Pablo Trinidad</p>\n\n<p>Veritasium</p>\n\n<p>Pablo Trinidad</p>\n\n<p>Smarter Everyday</p>\n\n<p>Eric Weinstein\nJoe rogan</p>\n\n<p>Ben Eater\n3Blue1Brown</p>\n\n",
      "date_published": "Tue, 02 Jun 2020 00:00:00 -0500"
      },
    
    {
      "id": "http://localhost:4000/2020/05/17/que-es-un-engine-de-javascript.html",
      "url": "http://localhost:4000/2020/05/17/que-es-un-engine-de-javascript.html",
      "title": "¿Qué es un engine de JavaScript?",
      "content_html": "<p>Me llamó mucho la atención  la salida de <a href=\"https://deno.land/v1\">Deno v1 esta semana</a> y le quise echar un ojito. Pero desde la explicación que da inicialmente, no entiendo <em>exactamente</em> lo que es y hace:</p>\n\n<blockquote>\n  <p>“Deno is a simple, modern and secure runtime for JavaScript and TypeScript that uses V8 and is built in Rust.”</p>\n</blockquote>\n\n<p>Aquí me surgió la pregunta: ¿Qué es un <strong>runtime</strong> para JavaScript?</p>\n\n<p>Pero para contestarla, antes tengo que entender <strong>qué es V8</strong>. La respuesta es: un <em>engine</em> o <em>motor</em> de JavaScript. En este artículo explicaremos qué es y cómo funciona.</p>\n\n<h2 id=\"explicación-rápida\">Explicación rápida</h2>\n\n<p>Puedes pensar en un engine o motor de JavaScript como en el programa encargado de correr el código de JavaScript. Todos los navegadores tienen uno:</p>\n\n<table>\n  <thead>\n    <tr>\n      <th>Navegador</th>\n      <th>Engine</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td><strong>Chrome</strong> y <strong>Opera</strong></td>\n      <td><a href=\"https://v8.dev/\">V8</a></td>\n    </tr>\n    <tr>\n      <td><strong>Firefox</strong></td>\n      <td><a href=\"https://developer.mozilla.org/en-US/docs/Mozilla/Projects/SpiderMonkey\">SpiderMonkey</a></td>\n    </tr>\n    <tr>\n      <td><strong>Safari</strong></td>\n      <td><a href=\"https://trac.webkit.org/wiki/JavaScriptCore\">WebKit JSCore</a></td>\n    </tr>\n    <tr>\n      <td><strong>Edge</strong></td>\n      <td><a href=\"https://github.com/microsoft/ChakraCore\">Chakra</a></td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Este, combinado con el motor web componen la mayor parte de un navegador. Los engines se pueden usar fuera de los navegadores para otras tareas, como en Deno o Node.</p>\n\n<blockquote>\n  <p>El <strong>motor de JavaScript</strong> es quien convierte tu código de JavaScript en código ejecutable por la máquina en la que va a correr.</p>\n</blockquote>\n\n<h2 id=\"teoría-compilación-contra-interpretación\">Teoría: Compilación contra Interpretación</h2>\n\n<p>Para correr un programa en cualquier lenguaje, hay que convertirlo en instrucciones que las computadoras puedan entender. Esto es el <strong>código máquina</strong>.</p>\n\n<p>Los lenguajes compilados transforman todo el código <strong>antes de ejecutarlo</strong>, por lo que pueden hacer optimizaciones generales para que el programa sea más eficiente.</p>\n\n<p>Para que el programa compile tiene que estar libre de errores. Generalmente esa compilación lleva un poco de tiempo, que va creciendo dependiendo del tamaño y complejidad del programa. Los programas compilados pueden ser más eficientes en ejecución, pero cuesta más empezarlos a correr.</p>\n\n<p>Los lenguajes interpretados van ejecutando <strong>línea por línea</strong>, sentencia por sentencia. Por esto mismo no pueden hacer optimizaciones generales, pero es más fácil y rápido para el programador <em>empezar</em> a ejecutarlos. Normalmente tienen un <strong>REPL</strong> (Read - Eval - Print - Loop) que puede servir para jugar con ellos y hacer pruebas.</p>\n\n<p>Se pude pensar que es <em>más fácil</em> desarrollar en lenguajes interpretados que compilados, por lo que su desarrollo es <em>más rápido</em>. Pero como los lenguajes compilados pueden hacer optimizaciones generales, son <strong>más eficientes</strong>.</p>\n\n<h2 id=\"la-ejecución-de-javascript\">La ejecución de JavaScript</h2>\n\n<p>JavaScript <em>nació</em> como lenguaje <strong>interpretado</strong>, para correr dentro del navegador Netscape. La idea principal de esto es que no necesitara de un paso de <em>compilación</em> previa, entendida como la generación de un producto intermedio que sea ejecutable.</p>\n\n<p>El encargado de esta “interpretación”, es decir, de convertir instrucciones de JavaScript en\ninstrucciones de la computadora es el <em>engine o motor</em>.</p>\n\n<p>Pero los motores modernos de JavaScript están muy optimizados, la ejecución de JS puede a veces compararse con la de lenguajes completamente compilados. Y esto es gracias las optimizaciones de compilación en el momento de la ejecución: <em>just in time</em> o <strong>JIT</strong>.</p>\n\n<p>En resumen: JavaScript dejó de de ser un lenguaje <em>puramente interpretado</em> para convertirse en un lenguaje híbrido, con interpretación y compilado JIT. Se comporta como interpretado cuando un programador lo corre, pero el motor compila el código, produciendo algunas veces un producto intermedio (bytecode) que puede ser optimizado para que las siguientes ejecuciones sean mucho más rápidas.</p>\n\n<h2 id=\"las-etapas-de-un-motor-de-javascript\">Las etapas de un motor de JavaScript</h2>\n\n<p>Ls principales etapas son:</p>\n\n<ol>\n  <li>\n    <p><strong>Escaneo</strong>. Convierte el texto del código que escribes en <em>tokens</em>. Un token es un bloque de carácteres que tienen un significado sintáctico. Ejemplo: <code class=\"language-plaintext highlighter-rouge\">x=33</code> está compuesto por 3 tokens: Un identificador (<code class=\"language-plaintext highlighter-rouge\">x</code>), un operador (<code class=\"language-plaintext highlighter-rouge\">=</code>) y un número (<code class=\"language-plaintext highlighter-rouge\">33</code>). Puedes irte por el hoyo del conejo si quieres entender como funciona el scanner de V8 aquí: <a href=\"https://v8.dev/blog/scanner\">Blazingly fast parsing</a></p>\n  </li>\n  <li>\n    <p><strong>Parseo</strong>. No encontré la palabra correcta para traducirlo, pero se puede entender como la ‘lectura’ de un texto que lo transforma en una estructura de datos. Esta fase convierte el conjunto de <em>tokens</em> generados por el scanner en un Árbol de Sintaxis Abstracta (AST - Abstract Sintax Tree). Este árbol representa tu programa sintácticamente y se pasa a la siguiente fase de la compilación.</p>\n  </li>\n  <li>\n    <p><strong>Interpretación</strong>. En esta fase se toma el AST y se convierte en una primera versión de código que la máquina ya puede ejecutar, <em>sin optimizaciones</em>. Genera además código intermedio (bytecode) que puede ser pasado a la siguiente etapa para optimizarlo. En V8 se llama <a href=\"https://medium.com/dailyjs/understanding-v8s-bytecode-317d46c94775\">Ignition</a></p>\n  </li>\n  <li>\n    <p><strong>Optimización</strong>. Esta parte es ejecutada por un compilador JIT, que analiza el código, cómo se comporta, los tipos de datos usados para crear una versión más optimizada en código máquina. Si las optimizaciones fallan, el bytecode sigue siendo ejecutado por el intérprete. En V8 se llama <a href=\"https://v8.dev/docs/turbofan\">TurboFan</a>.</p>\n  </li>\n</ol>\n\n<p>Las últimas dos etapas son donde el código se ejecuta, una en forma de bytecode interpretado y la otra en forma de código máquina <strong>altamente eficiente y optimizado</strong>.</p>\n\n<p>Aquí puedes ver un diagrama de la secuencia de operaciones de V8.</p>\n\n<p><img src=\"https://res.cloudinary.com/hectorip/image/upload/v1589700777/1_ZIH_wjqDfZn6NRKsDi9mvA_wc08nl.png\" alt=\"Ejecución de un script de JavaScript\" /></p>\n\n<h2 id=\"ejecución\">Ejecución</h2>\n\n<p>Durante la ejecución, el motor de JavaScript debe mantener por lo menos dos cosas:</p>\n\n<ol>\n  <li>La información de tu programa</li>\n  <li>En qué parte del programa estamos</li>\n</ol>\n\n<p>Esto lo hace mediante dos espacios de memoria organizados específicamente para estas tareas:</p>\n\n<ol>\n  <li>El <strong>Heap</strong>. Encargado de mantener la información de las variables y todo otro dato ocupado por el programa.</li>\n  <li>El <strong>Stack</strong>. Encargado de llevar un registro de las llamadas a funciones y contextos de ejecución.</li>\n</ol>\n\n<p>Además necesitamos a alguien que libere memoria para que nuestro programa no crezca infinitamente en la memoria y el <em>heap</em> sea fácil de acceder. Esto es el <strong>garbage collector</strong> o <em>recolector de basura</em>.</p>\n\n<p>Todo este proceso complejo se explica en mayor profundidad aquí: <a href=\"https://deepu.tech/memory-management-in-v8/\">Visualizing memory management in V8 Engine</a>.</p>\n\n<h2 id=\"conclusión\">Conclusión</h2>\n\n<p>Esto es lo básico que necesitamos entender de lo que hace un motor de JavaScript, el encargado de ejecutar el código. Pero no es suficiente contar con alguien que pueda correr el código, necesitamos además <strong>algo que nos proporcione el material para trabajar</strong>, ya que los programas en general actúan sobre algo, u obtienen información de algún lado. Esto es el <strong>Runtime</strong>, que explicaremos en el siguiente artículo.</p>\n",
      "date_published": "Sun, 17 May 2020 00:00:00 -0500"
      },
    
    {
      "id": "http://localhost:4000/2020/05/16/cursos-certificados-gratuitos.html",
      "url": "http://localhost:4000/2020/05/16/cursos-certificados-gratuitos.html",
      "title": "Cursos certificados gratuitos",
      "content_html": "<p>Debido a la emergencia sanitaria mundial, algunas universidades han liberado cursos\nque además de auditar, puedes cursar para obtener un <strong>cetificado</strong>. Si quieres mejorar un poco tu perfil del LinkedIn aquí te ponemos unos cursos de tecnología que puedes tomar.</p>\n\n<h2 id=\"programación\">Programación</h2>\n\n<ul>\n  <li>\n    <p><a href=\"https://www.classcentral.com/course/computer-programming-for-everyone-17488\">Computer Programming For Everyone</a></p>\n  </li>\n  <li><a href=\"https://www.coursera.org/learn/c-plus-plus-a?edocomorp=free-courses-high-school\">C++ For C Programmers</a></li>\n  <li><a href=\"https://www.classcentral.com/course/codeyourself-2938\">Code Yourself! An introduction to Programming</a></li>\n  <li>\n    <p><a href=\"https://www.classcentral.com/course/android-app-5719\">Build Your First Android App</a></p>\n  </li>\n  <li>\n    <p><a href=\"https://www.classcentral.com/course/aprogramar-2939\">¡A Programar! Una introducción a la programación</a></p>\n  </li>\n  <li><a href=\"https://www.classcentral.com/course/robotica-inicial-4659\">Robótica (para niños)</a></li>\n  <li><a href=\"https://www.coursera.org/learn/computer-vision-basics\">Computer Vision Basics</a></li>\n</ul>\n\n<h2 id=\"ia-y-machine-learning\">IA y Machine Learning</h2>\n\n<h3 id=\"español\">Español</h3>\n\n<ul>\n  <li><a href=\"https://www.classcentral.com/course/ai-for-everyone-es-13786\">IA para todos</a></li>\n</ul>\n\n<h3 id=\"inglés\">Inglés</h3>\n\n<ul>\n  <li><a href=\"https://www.classcentral.com/course/datasciencemathskills-7745\">Data Scince Math Skills</a></li>\n  <li><a href=\"https://www.classcentral.com/course/machine-learning-business-professionals-13415\">Machine Learning for Business Professionals</a></li>\n</ul>\n\n<h2 id=\"cloud-computing\">Cloud Computing</h2>\n\n<ul>\n  <li><a href=\"https://www.classcentral.com/course/cloud-computing-basics-18069\">Cloud Computing Basics</a></li>\n  <li><a href=\"https://www.classcentral.com/course/gcp-fundamentals-aws-8614\">Google Cloud Platform Fundamentals for AWS Professionals</a></li>\n  <li><a href=\"https://www.classcentral.com/course/aws-machine-learning-16924\">Getting Started with AWS Machine Learning</a></li>\n  <li><a href=\"https://www.classcentral.com/course/cloud-identity-10785\">Introduction to Cloud Identity</a></li>\n  <li><a href=\"https://www.classcentral.com/course/iiot-google-cloud-platform-12701\">Industrial IoT on Google Cloud Platform</a></li>\n  <li><a href=\"https://www.classcentral.com/course/developing-ai-applications-azure-17329\">Developing AI Applications on Azure</a></li>\n  <li><a href=\"https://www.classcentral.com/course/conversational-experiences-dialogflow-12529\">Building Conversational Experiences with Dialogflow</a></li>\n  <li><a href=\"https://www.classcentral.com/course/aws-computer-vision-gluoncv-17327\">AWS Computer Vision: Getting Started with GluonCV</a></li>\n</ul>\n\n<h2 id=\"matemáticas\">Matemáticas</h2>\n\n<h3 id=\"español-1\">Español</h3>\n\n<ul>\n  <li>\n    <p><a href=\"https://www.coursera.org/learn/estadistica-probabilidad\">Estadística y probabilidad (UNAM)</a></p>\n  </li>\n  <li><a href=\"https://www.classcentral.com/course/calculo-1-4231\">El Cálculo - Modelo Lineal</a></li>\n  <li><a href=\"https://www.classcentral.com/course/calculo-2-4226\">El Cálculo - Modelo Cuadrático</a></li>\n  <li><a href=\"https://www.classcentral.com/course/calculo-3-4284\">El Cálculo - Modelo Cúbico</a></li>\n  <li><a href=\"https://www.classcentral.com/course/calculo-4-4167\">El Cálculo - Otros Modelos</a></li>\n</ul>\n\n<h3 id=\"inglés-1\">Inglés</h3>\n\n<ul>\n  <li><a href=\"https://www.coursera.org/learn/matlab\">Introduction to Matlab</a></li>\n  <li><a href=\"https://www.classcentral.com/course/datasciencemathskills-7745\">Data Scince Math Skills</a></li>\n  <li><a href=\"https://www.classcentral.com/course/introduccion-al-calculo-4225\">Pre-Calculus</a></li>\n  <li><a href=\"https://www.classcentral.com/course/introduction-to-calculus-12547\">Introduction to Calculus</a></li>\n</ul>\n\n<h2 id=\"diseño\">Diseño</h2>\n\n<ul>\n  <li><a href=\"https://www.coursera.org/learn/design\">Design: Creation of Artifacts in Society</a></li>\n  <li><a href=\"https://www.classcentral.com/course/design-language-16927\">The Language of Design: Form and Meaning</a></li>\n</ul>\n\n<h2 id=\"otros-temas\">Otros temas</h2>\n\n<h3 id=\"español-2\">Español</h3>\n\n<ul>\n  <li><a href=\"https://www.classcentral.com/course/pensamiento-sistemico-4332\">Pensamiento Sistémico</a></li>\n  <li>\n    <p><a href=\"https://www.classcentral.com/course/mindshift-transforma-mente-10619\">Mindshift: Transforma tu mente para superar obstáculos en el aprendizaje y descubrir tu potencial oculto</a></p>\n  </li>\n  <li>\n    <p><a href=\"https://www.classcentral.com/course/arte-publico-pedagogia-7196\">ART of the MOOC: Arte Público y Pedagogía</a></p>\n  </li>\n  <li>\n    <p><a href=\"https://www.classcentral.com/course/escritura-esp-13496\">Fundamentos de la Escritura</a></p>\n  </li>\n  <li>\n    <p><a href=\"https://www.classcentral.com/course/innovacion-734\">Desarrollo rápido de productos innovadores para mercados emergentes</a></p>\n  </li>\n  <li><a href=\"https://www.classcentral.com/course/hablar-bien-en-publico-10518\">Cómo hablar bien en público</a></li>\n</ul>\n\n<h3 id=\"inglés-2\">Inglés</h3>\n\n<ul>\n  <li>\n    <p><a href=\"https://www.classcentral.com/course/teamwork-skills-effective-communication-9661\">Teamwork Skills: Communicating Effectively in Groups</a></p>\n  </li>\n  <li><a href=\"https://www.classcentral.com/course/personal-branding-4865\">Introduction to personal branding</a></li>\n  <li><a href=\"https://www.classcentral.com/course/understanding-arguments-6620\">Think Again I</a></li>\n  <li><a href=\"https://www.classcentral.com/course/market-analytics-4868\">Marketing Analytics</a></li>\n  <li>\n    <p><a href=\"https://www.classcentral.com/course/skills-management-11218\">Introduction to Skills Management</a></p>\n  </li>\n  <li>\n    <p><a href=\"https://www.classcentral.com/course/how-to-write-a-scientific-paper-5816\">How to Write and Publish a Scientific Paper</a></p>\n  </li>\n  <li>\n    <p><a href=\"https://www.classcentral.com/course/emerging-technologies-lifelong-learning-10396\">Exploring Emerging Technologies for Lifelong Learning and Success</a></p>\n  </li>\n  <li><a href=\"https://www.classcentral.com/course/making-architecture-7153\">MAking Architecture</a></li>\n</ul>\n\n<p>Puedes ver una lista actualizada de los cursos aquí: <a href=\"https://www.classcentral.com/report/free-online-learning-coronavirus/\">Free Learning Due to Coronavirus</a>. Es emocionante ver todo lo que se puede aprender si uno puede ponerle el tiempo necesario.</p>\n",
      "date_published": "Sat, 16 May 2020 00:00:00 -0500"
      },
    
    {
      "id": "http://localhost:4000/2020/04/27/entendiendo-es6.html",
      "url": "http://localhost:4000/2020/04/27/entendiendo-es6.html",
      "title": "Entendiendo ES6",
      "content_html": "<p>Hace tiempo dimos un curso de ES6 o ES2015. Hicimos una investigación acerca de la historia, la nomenclatura, quién lo creo y porque tanta confusión con los nombres.</p>\n\n<p>En este video explicamos eso y más: las características principales que se agregaron y la diferencia entre JavaScript y ECMAScript.</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/ZnS37QdoTDA\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n\n<hr />\n\n<p>¿Tienes dudas específicas de JavaScript? Compártelas en los comentarios e intentaremos hacer videos sobre eso.</p>\n",
      "date_published": "Mon, 27 Apr 2020 00:00:00 -0500"
      },
    
    {
      "id": "http://localhost:4000/2020/04/15/a-philosophy-of-software-design-organiza-bien-los-sistemas-en-capas.html",
      "url": "http://localhost:4000/2020/04/15/a-philosophy-of-software-design-organiza-bien-los-sistemas-en-capas.html",
      "title": "A Philosophy of Software Design: Organiza bien los sistemas en capas",
      "content_html": "<p>Hemos escuchado muchísimo acerca de los sistemas en capas como MVC, MVT, MV*, <em>MVADFGDFD</em> etc. La mayoría de los sistemas actuales se organiza así: <strong>en capas</strong>.</p>\n\n<p>Hablemos de por qué es efectiva esta forma de organización\nde código, de sus características y cómo debemos organizar el código para sacar el máximo provecho.</p>\n\n<h2 id=\"características-de-los-sistemas-en-capas\">Características de los sistemas en capas</h2>\n\n<p>Sabemos que la mejor forma de organización de un proyecto es <strong>descomponerlo</strong> en partes independientes que <strong>oculten</strong> información de otras.</p>\n\n<p>La comunicación entre las diferentes partes se da por medio de una <strong>interfaz</strong>. Esta interfaz, es la <strong>API</strong> del componente.</p>\n\n<h2 id=\"qué-evitar\">Qué evitar</h2>\n\n",
      "date_published": "Wed, 15 Apr 2020 00:00:00 -0500"
      },
    
    {
      "id": "http://localhost:4000/2020/04/02/a-philosophy-of-software-design-crea-modulos-de-proposito-general.html",
      "url": "http://localhost:4000/2020/04/02/a-philosophy-of-software-design-crea-modulos-de-proposito-general.html",
      "title": "A Philosophy of Software Design: Crea módulos de propósito general",
      "content_html": "<p>Una burla común hacia los programadores es que todo lo queremos hacer <em>demasiado general</em>. Nos piden una funcionalidad y en ese momento empezamos a pensar en todos los casos en los que podría ser usado en el universo.</p>\n\n<p>Hay muchos consejos <strong>en contra</strong> de escribir código que abarque\nmuchos casos. En este artículo vamos a hablar de las ventajas y\ndesventajas de módulos de <strong>propósito general</strong>, es decir, vamos a\nhablar en contra de la sabiduría popular.</p>\n\n<p>Pero además hablaremos <strong>del equilibrio</strong> y cómo lograrlo.</p>\n\n<h2 id=\"especificidad-de-un-módulo\">Especificidad de un módulo</h2>\n\n<p>Puedes pensar en la especialización de un módulo (o del código en general) como en continuo que va desde algo que se puede utilizar en muchos muchos casos (las bibliotecas estándar) hasta código que sólo sirve para un uso muy acotado y es muy difícil de cambiar.</p>\n\n<p><img src=\"https://res.cloudinary.com/hectorip/image/upload/c_scale,w_1200/v1585279283/7655B57E-A45D-4832-A0D6-41670C22D6CA_boy7ej.png\" alt=\"Gráfica del continuo de especificidad\" /></p>\n\n<p>Un módulo específico está dedicado a cumplir <em>una sola función</em> en el sistema y sólo se puede usar para eso. Si los pensáramos como conectores para un dispositivo, como un celular, podrías decir que es la conexión especial que Nokia, Apple o Sony Ericsson se inventaron en su tiempo para cargar.</p>\n\n<p>Un módulo de propósito general se puede usar para varios casos con <em>poca modificación</em>, o creando un módulo más específico a partir de él. En el mismo ejemplo de los dispositivos electrónicos puede compararse al estándar USB que sirve para múltiples cosas y puede ser usado en muchos aparatos diferentes.</p>\n\n<h2 id=\"módulos-específicos\">Módulos específicos</h2>\n\n<p>El caso más extremo del código específico es el que llamamos <em>hardcoding</em>. Es tan específico que sirve sólo para una instancia muy pequeña de un problema y <em>no es fácil de modificar en producción</em>.</p>\n\n<p>Se entiende como <em>hardcoding</em> a poner directamente en el código un valor fijo que pudiera variar en el futuro: configuración de IP’s, conexión a bases de datos, nombres de usuario, etc. Y es uno de los casos extremos de <a href=\"https://blog.thedojo.mx/2020/02/11/a-philosophy-of-software-design-programacion-tactica-vs-estrategica.html#desarrollo-t%C3%A1ctico\">programación táctica</a>. Por lo tanto, y esto todos lo sabemos, es una <strong>muy mala  práctica</strong> para crear código mantenible e incluso para la practicidad en el desarrollo.</p>\n\n<p>El siguiente nivel de especificidad y con el que casi todos nos quedamos contentos es cuando creamos un módulo (una clase, por ejemplo), para una <em>función específica</em> de nuestro sistema y que <em>sólo puede usarse ahí</em>.</p>\n\n<p>Usemos como ejemplo un programa para registrar publicaciones impresas como libros, revistas, periódicos, panfletos, etc. Una manera de diseñarlo es creando en el módulo una función para cada tipo de publicación:</p>\n\n<div class=\"language-python highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>\n<span class=\"k\">def</span> <span class=\"nf\">registrar_libro</span><span class=\"p\">(...):</span>\n  <span class=\"k\">pass</span>\n\n<span class=\"k\">def</span> <span class=\"nf\">registrar_revista</span><span class=\"p\">(...):</span>\n  <span class=\"k\">pass</span>\n\n<span class=\"p\">...</span>\n\n<span class=\"k\">def</span> <span class=\"nf\">registrar_panfleto</span><span class=\"p\">(...):</span>\n  <span class=\"k\">pass</span>\n\n</code></pre></div></div>\n\n<p>Esto nos llevaría a tener una interfaz muy amplia y generalmente funciones o módulos poco profundos. Además, si agregamos un nuevo tipo de publicación se tendría que crear una nueva función para atenderlo.</p>\n\n<h2 id=\"módulos-de-propósito-general\">Módulos de propósito general</h2>\n\n<p>Un módulo de propósito general puede tener, casi siempre, una interfaz más sencilla que un módulo de propósito específico. Siguiendo con el ejemplo de los libros, en vez de crear una función para cada uno de los tipos de publicación se podría crear una general:</p>\n\n<div class=\"language-python highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>\n<span class=\"k\">def</span> <span class=\"nf\">registrar_publicacion</span><span class=\"p\">(...):</span>\n  <span class=\"k\">pass</span>\n\n\n<span class=\"k\">def</span> <span class=\"nf\">registrar_tipo_de_publicacion</span><span class=\"p\">(...):</span>\n  <span class=\"k\">pass</span>\n\n</code></pre></div></div>\n\n<p>Esto permitiría tener una interfaz más sencilla con aplicaciones <em>más amplias</em>, con más usos.</p>\n\n<p>El ejemplo mencionado por <a href=\"https://amzn.to/3ba4MEj\">A Philosophy of Software Design</a> es el de un editor de texto con interfaz gráfica. La clase encargada de almacenar el texto en memoria deber tener las capacidades para modificarlo.</p>\n\n<p>Piensa en las operaciones que los editores de texto dan: insertar texto, borrar texto hacia adelante, borrar texto hacia atrás, seleccionar, copiar, pegar. Ousterhout menciona que implementar una función <em>específica</em> para cada una de estas operaciones crea complejidad no necesaria. Un diseño más general permite hacer tres operaciones: insertar texto, borrar texto y mover el cursor. Todas las operaciones se pueden lograr con estas otras tres, teniendo una interfaz más sencilla.</p>\n\n<p>Este debería ser nuestro objetivo: crear interfaces sencillas que hagan mucho por nosotros.</p>\n\n<h2 id=\"por-qué-hacer-módulos-de-propósito-general\">¿Por qué hacer módulos de propósito general?</h2>\n\n<p>El principal motivo que <a href=\"https://amzn.to/3ba4MEj\">A Philosophy of Software Design</a> menciona es que los módulos de propósito general <a href=\"https://blog.thedojo.mx/2020/03/02/a-philosophy-of-software-design-los-modulos-deben-ser-profundos.html#dise%C3%B1o-de-m%C3%B3dulos\">son más profundos</a> es decir, encierran más funcionalidad con una interfaz pequeña.</p>\n\n<p>Hacerlo contribuye a que tu código esconda más información y por lo tanto su uso sea más simple.</p>\n\n<p>Además los módulos demasiado específicos crean <strong>acoplamiento</strong> en el sistema que no es sano: los usuarios del módulo tienen que adaptarse a una interfaz mu específica.</p>\n\n<p>Los módulos de propósito general te pueden quitar trabajo en el futuro, al requerir menos modificación y poder reutilizar su código para crear nuevas funcionalidades, como en el caso extremo de las bibliotecas estándar.</p>\n\n<p>Y por último una interfaz demasiado específica puede filtrar información no necesaria.</p>\n\n<h2 id=\"equilibrio\">Equilibrio</h2>\n\n<p>La clave para elegir qué tan específico es tu módulo es la forma en la que lo vas a utilizar: tu pieza de código tiene que ser <strong>tan general</strong> como puedas sin que dificulte demasiado su uso actual.</p>\n\n<p>Tienes que evaluar qué tanto desvía del uso específico inmediato el que modifiques la interfaz para crear algo que pueda ser reutilizado.</p>\n\n<h2 id=\"conclusión\">Conclusión</h2>\n\n<p>Crear módulos de “no tan específicos” puede ayudarte a:</p>\n\n<ol>\n  <li><strong>Ocultar mejor la información</strong>.</li>\n  <li><strong>Crear interfaces más concisas</strong>.</li>\n  <li><strong>Reutilizar mejor el código</strong>.</li>\n</ol>\n\n<p>Tienes que buscar el equilibrio entre crear un módulo tan específico que sólo uses una vez, contra un módulo que cubra todos los casos del mundo. El equilibrio está en un módulo que no sea difícil de utilizar para tu problema a la mano pero que puede ser (o este siendo) utilizado en varios lugares y de varias formas si es el caso.</p>\n\n<p>Tu “yo” del futuro te agradecerá si logras encontrar el equilibrio, porque podrás crear funcionalidades más rápido, <em>acelerar</em>: una característica de la programación estratégica.</p>\n\n<p>En el próximo artículo hablaremos de los sistemas en capas y cómo aprovechar sus particularidades para crear diseños que dominen la complejidad.</p>\n",
      "date_published": "Thu, 02 Apr 2020 00:00:00 -0600"
      }
    
  ]
}
        
      </section>

      <footer class="page__meta">
        
        


        

      </footer>

      

      
    </div>

    
  </article>

  
  
</div>

    </div>

    
      <div class="search-content">
        <div class="search-content__inner-wrap"><form class="search-content__form" onkeydown="return event.key != 'Enter';">
    <label class="sr-only" for="search">
      Enter your search term...
    </label>
    <input type="search" id="search" class="search-input" tabindex="-1" placeholder="Enter your search term..." />
  </form>
  <div id="results" class="results"></div></div>

      </div>
    

    <div id="footer" class="page__footer">
      <footer>
        
<!-- Begin Mailchimp Signup Form -->
<link href="//cdn-images.mailchimp.com/embedcode/horizontal-slim-10_7.css" rel="stylesheet" type="text/css">
<style type="text/css">
	#mc_embed_signup{background:#fff; clear:left; font:14px Helvetica,Arial,sans-serif; width:100%;}
</style>
<div id="mc_embed_signup">
<form action="https://thedojo.us20.list-manage.com/subscribe/post?u=8e502c6ff53aacad881b3629d&amp;id=c9486cf5f1" method="post" id="mc-embedded-subscribe-form" name="mc-embedded-subscribe-form" class="validate" target="_blank" novalidate>
    <div id="mc_embed_signup_scroll">
	<label for="mce-EMAIL">Suscríbete</label>
	<input type="email" value="" name="EMAIL" class="email" id="mce-EMAIL" placeholder="email address" required>
    <!-- real people should not fill this in and expect good things - do not remove this or risk form bot signups-->
    <div style="position: absolute; left: -5000px;" aria-hidden="true"><input type="text" name="b_8e502c6ff53aacad881b3629d_c9486cf5f1" tabindex="-1" value=""></div>
    <div class="clear"><input type="submit" value="Subscribe" name="subscribe" id="mc-embedded-subscribe" class="button"></div>
    </div>
</form>
</div>
<!--End mc_embed_signup-->

<!-- <script type="text/javascript" src="/assets/jquery.scrolldepth.min.js"></script> -->

<script>
    var sharect = new Sharect();
    sharect.config({
    //   facebook: true,
      twitter: true,
      twitterUsername: '@thedojomx',
      backgroundColor: '#ff4081',
      iconColor: '#fff'
    }).init();

</script>

<script type="text/javascript" src="//downloads.mailchimp.com/js/signup-forms/popup/unique-methods/embed.js" data-dojo-config="usePlainJson: true, isDebug: false"></script><script type="text/javascript">window.dojoRequire(["mojo/signup-forms/Loader"], function(L) { L.start({"baseUrl":"mc.us20.list-manage.com","uuid":"8e502c6ff53aacad881b3629d","lid":"c9486cf5f1","uniqueMethods":true}) })</script>
        <div class="page__footer-follow">
  <ul class="social-icons">
    
      <li><strong>Seguir:</strong></li>
    

    

    <li><a href="/feed.xml"><i class="fas fa-fw fa-rss-square" aria-hidden="true"></i> Feed</a></li>
  </ul>
</div>

<div class="page__footer-copyright">&copy; 2020 . Powered by <a href="https://jekyllrb.com" rel="nofollow">Jekyll</a> &amp; <a href="https://mademistakes.com/work/minimal-mistakes-jekyll-theme/" rel="nofollow">Minimal Mistakes</a>.</div>

      </footer>
    </div>

    
  <script src="/assets/js/main.min.js"></script>
  <script src="https://kit.fontawesome.com/4eee35f757.js"></script>




<script src="/assets/js/lunr/lunr.min.js"></script>
<script src="/assets/js/lunr/lunr-store.js"></script>
<script src="/assets/js/lunr/lunr-en.js"></script>







  </body>
</html>
